import streamlit as st

st.title("👨‍💻 О проекте")

st.markdown("""
Создатель: **Брунов Даниил**

Приложение разработано в рамках выпускной квалификационной работы (ВКР) по теме:
 **"Разработка AI-приложения для прогнозирования диабета"**
🎓 Образовательное учреждение: НГПУ им.Козьмы Минина
💻 Используемые технологии:
  - ЯП Python, фреймворк Streamlit как FullStack-основа приложения
  - библиотеки scikit-learn, pandas, seaborn для работы с данными и моделью МО
  - библиотеки pickle, pathlib, PIL для загрузки и отображения всех дополнительных компонент
  - модули pytest, locust для тестирования приложения

📬 Контакты:
  - Email: danilabrunov@gmail.com
  - GitHub: [github.com/ouvwte](https://github.com)
  - Telegram: [@danilb575](https://t.me/)


---
Спасибо, что используете приложение!
""")